class Static {
  static improvementType = [
    [
      {
        value: 'تامین الزامات ایمنی تجهیزات و نیروی انسانی',
        label: 'تامین الزامات ایمنی تجهیزات و نیروی انسانی'
      },
      {
        value: 'رفع موانع جهت دستیابی به ظرفیت اسمی',
        label: 'رفع موانع جهت دستیابی به ظرفیت اسمی'
      },
      {
        value: 'جلوگیری از تولید محصول نامنطبق',
        label: 'جلوگیری از تولید محصول نامنطبق'
      }
    ],
    [
      {
        value: 'بهبود در راندمان فرایندهای تولیدی',
        label: 'بهبود در راندمان فرایندهای تولیدی'
      },
      {
        value: 'رفع موانع جهت دستیابی به ظرفیت برنامه ای',
        label: 'رفع موانع جهت دستیابی به ظرفیت برنامه ای'
      },
      {
        value: 'افزایش راندمان مصرف انرژی',
        label: 'افزایش راندمان مصرف انرژی'
      }
    ],
    [
      {
        value: 'جلوگیری از خرابی مکرر تجهیزات عملیاتی',
        label: 'جلوگیری از خرابی مکرر تجهیزات عملیاتی'
      },
      {
        value: 'بهبود در عملیات بهره برداری و تعمیرات',
        label: 'بهبود در عملیات بهره برداری و تعمیرات'
      },
      {
        value: 'کاهش و یا حذف عوامل زیان آور زیست محیطی',
        label: 'کاهش و یا حذف عوامل زیان آور زیست محیطی'
      }
    ],
    [
      {
        value: 'افزایش ظرفیت اسمی تولید',
        label: 'افزایش ظرفیت اسمی تولید'
      },
      {
        value: 'بهبود شرایط سلامت، محیط کار و ارگونومی',
        label: 'بهبود شرایط سلامت، محیط کار و ارگونومی'
      },
      {
        value: 'تولید گریدهای جدید',
        label: 'تولید گریدهای جدید'
      }
    ],
    [
      {
        value: 'بهبود در پایش سرویس های مبادلاتی',
        label: 'بهبود در پایش سرویس های مبادلاتی'
      },
      {
        value: 'درخواست های خدماتی، اداری و غیر فرایندی',
        label: 'درخواست های خدماتی، اداری و غیر فرایندی'
      }
      // {
      //   value: 'سایر موارد',
      //   label: 'سایر موارد'
      // }
    ]
  ]
  static conditionsList = [
    {
      value:
        'درخواست‌، ماهیت تعمیراتی دارد و بایستی درخواست کار تعمیراتی صادر گردد',
      label:
        'درخواست‌، ماهیت تعمیراتی دارد و بایستی درخواست کار تعمیراتی (W.O) صادر گردد'
    },
    {
      value:
        'درخواست، اجرای اصلاحات موقتی می‌باشد که نیازی به تغییر در اسناد فنی نمی‌باشد',
      label:
        'درخواست، اجرای اصلاحات موقتی می‌باشد که نیازی به تغییر در اسناد فنی نمی‌باشد'
    },
    {
      value: 'درخواست، مربوط به خارج از محدوده تعریف شده مجتمع می‌باشد',
      label: 'درخواست، مربوط به خارج از محدوده تعریف شده مجتمع می‌باشد'
    },
    {
      value:
        'درخواست، ماهیت پروژه‌ای دارد و بایستی در قالب درخواست پروژه صادر گردد',
      label:
        'درخواست، ماهیت پروژه‌ای دارد و بایستی در قالب درخواست پروژه (PRA) صادر گردد'
    },
    {
      value:
        'درخواست، اضطراری بوده و بایستی از طریق برگزاری جلسه فنی تصمیم گیری گردد',
      label:
        'درخواست، اضطراری بوده و بایستی از طریق برگزاری جلسه فنی تصمیم گیری گردد'
    },
    {
      value:
        'درخواست، اجرای اصلاحلات موقتی است و نیازمند تغییر در اسناد فنی می‌باشد.',
      label:
        'درخواست، با حوزه تخصصی اداره متقاضی (بند 1-6 روش اجرایی) تطابق ندارد'
    },
    {
      value: 'سایر موارد',
      label: 'سایر موارد'
    }
  ]
}
export default Static
