class Message {
  static messages = [
    { code: 208, message: 'لطفا اول Project Code را وارد نمائید.' },
    { code: 209, message: 'شما قبلا لاگین کرده اید' },
    { code: 210, message: 'لطفا دوباره تلاش کنید' },
    { code: 211, message: 'مشکلی رخ داده ، لطفا دوباره تلاش کنید' },
    { code: 212, message: 'لطفا دوباره وارد بشوید' },
    { code: 213, message: 'سطوح دسترسی دچار خطا شده است' },
    { code: 214, message: 'مجوز دسترسی این قسمت صادر نشده است' },
    { code: 312, message: 'رکورد درخواستی یافت نشد' },
    { code: 315, message: 'قبلا ثبت شده است' },
    { code: 260, message: 'مقادیر خواسته شده ارسال نشده است' },
    { code: 261, message: 'مقادیر ارسال شده صحیح نمی‌باشد' },
    { code: 404, message: 'اطلاعات مورد نظر یافت نشد' },
    { code: 408, message: 'ارتباط شما با اینترنت برقرار نیست' },
    { code: 506, message: 'به علت اضافه شدن کارگروه دیگر اولویت امضا تغییر یافت' },
    { code: 320, message: 'اطلاعات ورود خود را چک کنید' },
    { code: 310, message: 'ایمیل وارد شده قبلا به ثبت رسیده است' },
    { code: 319, message: 'تصویر امضا ارسال نشده است' },
    { code: 311, message: 'رمز عبور وارد شده صحیح نمی‌باشد' },
    {
      code: 313,
      message: 'مجوز ثبت داکیومنت با دیسیپلین های مختلف صادر نشده است'
    },
    {
      code: 314,
      message: 'داکیومت مورد نظر قبلا در همین transmittal ثبت شده است'
    },
    { code: 99, message: 'لطفا همه مقادیر خواسته شده را وارد نمائید' },
    { code: 100, message: 'فرم با موفقیت بروز رسانی شد' },
    { code: 900, message: 'ثبت با موفقیت انجام شد' },
    { code: 901, message: 'تغییرات با موفقیت ایجاد شد' },
    { code: 902, message: 'نظر شما در مورد این ترنسمیتال ثبت شد' },
    { code: 903, message: 'کاربر با موفقیت اضافه شد' },
    { code: 904, message: 'کاربر با موفقیت ویرایش شد' },
    { code: 905, message: 'جلسه با موفقیت ایجاد شد' },
    { code: 906, message: 'تغییرات با موفقیت ایجاد شد' },
    { code: 907, message: 'جلسه با موفقیت پایان یافت' },
    { code: 908, message: 'لطفا همه مقادیر سند قبلی را پر کنید' },
    { code: 909, message: 'گالری با موفقیت حذف شد' },
    { code: 910, message: 'نظر شما در مورد این کامنت شیت ثبت شد' },
    { code: 911, message: 'زمان شروع از زمان خاتمه بزرگتر می‌باشد' },
    { code: 912, message: 'لطفا زمان خود را به طور صحیح وارد نمایید' },
    { code: 913, message: 'زمان وارد شده از زمان تعیین شده بیشتر میباشد' },
    { code: 914, message: 'نظر شما در مورد این صورت جلسه ثبت شد' },
    { code: 915, message: 'جلسه با موفقیت ویرایش شد' },
    { code: 916, message: 'کاربر یافت نشد' },
    { code: 917, message: 'کد وارد شده نامعتبر است' },
    { code: 918, message: 'رمز شما با موفقیت تغییر یافت' },
    { code: 919, message: 'لطفا حداقل یکی از موارد را پر کنید' },
    { code: 920, message: 'نظر شما در مورد این درخواست فنی ثبت شد' },
    { code: 921, message: 'بروز رسانی با موفقیت انجام شد' },
    { code: 922, message: 'عنوان در دیتابیس نباید مانند هم باشد' },
    { code: 923, message: 'مقادیر نمی‌توانند تکراری باشند' },
    { code: 924, message: 'نظر شما در مورد این tsr ثبت شد' },
    { code: 925, message: 'هیچ داده ای یافت نشد' },
    { code: 926, message: 'درخواست شما برای ویرایش با موفقیت انجام شد' },
    { code: 927, message: 'حذف با موفقیت انجام شد' },
    { code: 928, message: 'نظر شما در مورد این ARP ثبت شد' },
    { code: 929, message: 'دستگردانی با موفقیت انجام شد' },
    { code: 930, message: 'نظر با موفقیت در مورد درخواست خدمات فنی انجام شد' },
    { code: 931, message: 'لطفا با کد پرسنلی خود وارد شوید' },
    { code: 932, message: 'لطفا اول مقادیر قبلی را پر نمائید' },
    { code: 933, message: 'درخواست انصراف با موفقیت انجام شد' },
    { code: 934, message: 'شما تمامی گروه‌ها را انتخاب کرده اید!' },
    { code: 935, message: 'درخواست خدمات فنی به حالت قبل بازگشت' },
    {
      code: 936,
      message: 'درخواست شما برای ویرایش گروه‌ها و اولویت‌ها انجام شد'
    },
    {
      code: 937,
      message: 'شما نمی‌تواند این مورد را حذف کنید'
    },
    { code: 938, message: 'لطفا فایل های مورد با فرمت صحیح انتخاب کنید' },
    { code: 1, message: 'شما یک پیام جدید دارد' },
    { code: 890, message: 'ارتباط با سرور برقرار نشد' }
  ]

  static text(code) {
    let msg = this.messages.find(message => message.code === code)
    return msg !== undefined
      ? msg.message
      : this.messages.find(message => message.code === 890).message
  }
}

export default Message
