class RejectReasons {
  static list = [
    {
        value:
          'درخواست‌، ماهیت تعمیراتی دارد و بایستی درخواست کار تعمیراتی صادر گردد',
        label:
          'درخواست‌، ماهیت تعمیراتی دارد و بایستی درخواست کار تعمیراتی (W.O) صادر گردد'
      },
      {
        value:
          'درخواست، اجرای اصلاحات موقتی می‌باشد که نیازی به تغییر در اسناد فنی نمی‌باشد',
        label:
          'درخواست، اجرای اصلاحات موقتی می‌باشد که نیازی به تغییر در اسناد فنی نمی‌باشد'
      },
      {
        value: 'درخواست، مربوط به خارج از محدوده تعریف شده مجتمع می‌باشد',
        label: 'درخواست، مربوط به خارج از محدوده تعریف شده مجتمع می‌باشد'
      },
      {
        value:
          'درخواست، ماهیت پروژه‌ای دارد و بایستی در قالب درخواست پروژه صادر گردد',
        label:
          'درخواست، ماهیت پروژه‌ای دارد و بایستی در قالب درخواست پروژه (PRA) صادر گردد'
      },
      {
        value:
          'درخواست، اضطراری بوده و بایستی از طریق برگزاری جلسه فنی تصمیم گیری گردد',
        label:
          'درخواست، اضطراری بوده و بایستی از طریق برگزاری جلسه فنی تصمیم گیری گردد'
      },
      {
        value:
          'درخواست، اجرای اصلاحلات موقتی است و نیازمند تغییر در اسناد فنی می‌باشد.',
        label:
          'درخواست، با حوزه تخصصی اداره متقاضی (بند 1-6 روش اجرایی) تطابق ندارد'
      },
      // {
      //   value: 'سایر موارد',
      //   label: 'سایر موارد'
      // }
  ]
}
export default RejectReasons
