import React, { Component } from 'react'
import SideBar from '../SideBar'
import ContentDrafts from './ContentDrafts'
export default class Drafts extends Component {
  constructor (props) {
    super(props)
    this.state = {
      list: [
        {
          title: 'لورم ایپسوم متن ساختگی با تولید',
          text:
            'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی',
          star: true,
          attach: true,
          nameAuthor: 'علیرضا کیان',
          date: 'یکشنبه 17 آذر 1399',
          time: '3 روز پیش',
          attachList: ['#', '#']
        }
      ],
      // dataSelected: {
      //   title: 'لورم ایپسوم متن ساختگی با تولید',
      //   text:
      //     'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی',
      //   star: true,
      //   attach: true,
      //   nameAuthor: 'علیرضا کیان',
      //   date: 'یکشنبه 17 آذر 1399',
      //   time: '3 روز پیش',
      //   attachList: ['#', '#']
      // }
    }
  }
  handleState = (name, value) => {
    this.setState({ [name]: value })
  }
  render () {
    return (
      <div className='col-12 h-100'>
        <div className='main-inbox'>
          <div className='row mx-0 h-100'>
            <SideBar {...this} />
            {this.state.dataSelected && <ContentDrafts {...this} />}
          </div>
        </div>
      </div>
    )
  }
}
