class ListRecovery {
  static list = [
    {
      value: 'تامین الزامات ایمنی تجهیزات و نیروی انسانی',
      label: 'تامین الزامات ایمنی تجهیزات و نیروی انسانی'
    },
    {
      value: 'رفع موانع جهت دستیابی به ظرفیت اسمی',
      label: 'رفع موانع جهت دستیابی به ظرفیت اسمی'
    },
    {
      value: 'جلوگیری از تولید محصول نامنطبق',
      label: 'جلوگیری از تولید محصول نامنطبق'
    },
    {
      value: 'بهبود در راندمان فرایندهای تولیدی',
      label: 'بهبود در راندمان فرایندهای تولیدی'
    },
    {
      value: 'رفع موانع جهت دستیابی به ظرفیت برنامه ای',
      label: 'رفع موانع جهت دستیابی به ظرفیت برنامه ای'
    },
    {
      value: 'افزایش راندمان مصرف انرژی',
      label: 'افزایش راندمان مصرف انرژی'
    },
    {
      value: 'جلوگیری از خرابی مکرر تجهیزات عملیاتی',
      label: 'جلوگیری از خرابی مکرر تجهیزات عملیاتی'
    },
    {
      value: 'بهبود در عملیات بهره برداری و تعمیرات',
      label: 'بهبود در عملیات بهره برداری و تعمیرات'
    },
    {
      value: 'کاهش و یا حذف عوامل زیان آور زیست محیطی',
      label: 'کاهش و یا حذف عوامل زیان آور زیست محیطی'
    },
    {
      value: 'افزایش ظرفیت اسمی تولید',
      label: 'افزایش ظرفیت اسمی تولید'
    },
    {
      value: 'بهبود شرایط سلامت، محیط کار و ارگونومی',
      label: 'بهبود شرایط سلامت، محیط کار و ارگونومی'
    },
    {
      value: 'تولید گریدهای جدید',
      label: 'تولید گریدهای جدید'
    },
    {
      value: 'بهبود در پایش سرویس های مبادلاتی',
      label: 'بهبود در پایش سرویس های مبادلاتی'
    },
    {
      value: 'درخواست های خدماتی، اداری و غیر فرایندی',
      label: 'درخواست های خدماتی، اداری و غیر فرایندی'
    }
  ]
}
export default ListRecovery
