const TabsTsr=[
    {
      id: 1,
      nameTab: 'صدور درخواست TSR',
      title: 'صدور درخواست توسط متقاضی'
    },
    {
      id: 2,
      nameTab: 'بررسی اولیه و انتخاب مسئول TSR',
      title: 'بررسی اولیه و انتخاب مسئول TSR و گروه کارشناسی'
    },
    {
      id: 3,
      nameTab: 'بررسی TSR توسط مهندس فرآیند',
      title: 'بررسی TSR توسط مهندس فرآیند'
    },
    {
      id: 4,
      nameTab: 'بررسی توسط اداره ایمنی',
      title: 'بررسی TSR از دیدگاه ایمنی ، سلامت و زیست محیطی (HSE)'
    },
    {
      id: 5,
      nameTab: 'بررسی TSR توسط مهندسی عمومی',
      title: 'بررسی TSR توسط مهندسی عمومی'
    },
    {
      id: 6,
      nameTab: 'کمیته TSR',
      title: 'کمیته TSR'
    },
    {
      id: 7,
      nameTab: 'دستور کار مهندسی',
      title: 'دستور کار مهندسی'
    },
    {
      id: 8,
      nameTab: 'دستور العمل بارزسی فنی',
      title: 'دستور العمل بارزسی فنی'
    },
    {
      id: 9,
      nameTab: 'اعلام پایان کار',
      title: 'اعلام پایان کار توسط مسئول اجرا'
    },
    {
      id: 10,
      nameTab: 'بررسی پایان اجرای کار',
      title: 'بررسی پایان اجرای کار'
    },
    {
      id: 11,
      nameTab: 'تحویل نقشه‌های As Built',
      title: 'تحویل نقشه‌های As Built'
    },
    {
      id: 12,
      nameTab: 'ارزیابی اثر بخشی',
      title: 'ارزیابی اثر بخشی'
    }
  ]
  export default TabsTsr